src/soap/MantisConnectBinding.mc_user_pref_get_pref.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://futureware.biz/mantisconnect">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:mc_user_pref_get_pref>
   <username></username>
   <password></password>
   <project_id></project_id>
   <pref_name></pref_name>
  </ns1:mc_user_pref_get_pref>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
